// let sum = ""
// const stars = Number(prompt("напишіть кількість зірочок"))
// switch (stars) {
// case 1:
// sum = "вартість вашого номеру 20$"
// break

// case 2:
//     sum = "вартість вашого номеру 30$"
// break

// case 3:
//     sum = "вартість вашого номеру 50$"
// break

// case 4:
//     sum = "вартість вашого номеру 70$"
// break

// case 5:
//     sum = "вартість вашого номеру 120$"
// break

// default:
// console.log('Такої кількості зірок немає')
// }

// console.log(sum)

// let sum = ""
// const stars = Number(prompt("Введіть кількість зірочок"))
// if (stars === 1) {
//   sum = `Вартість вашого номеру 20$`;
// } else if (stars === 2) {
//   sum = `Вартість вашого номеру 30$`;
// } else if (stars === 3) {
//   sum = `Вартість вашого номеру 50$`;
// } else if (stars === 4) {
//   sum = `Вартість вашого номеру 70$`;
// } else if (stars === 5) {
//   sum = `Вартість вашого номеру 120$`;
// } else {
//     console.log("Токої кількості зірок немає");
// }
// console.log(sum)



//1. Напиши скрипт вибору опції доставки товару. Опція зберігається в змінній option: 1 - самовивіз, 2 кур"єр, 3- пошта. В змінну message записати повідомлення в залежності від опції:
// const selfPickup = "Ви можете забрати товар завтра в магазині"
// const curier = "Курєр доставить замовлення завтрпа, з 10 до 18"
// const post = "Відправимо замовлення сьогодні"
// alert(
//   `Виберіть один з варіантів отримання замовлення:\n 1 ${selfPickup},\n 2 ${curier},\n 3 ${post}`
// );

// switch (option) {
//     case 1:
//         console.log(selfPickup);
//     break;
//     case 2:
//         console.log(curier);
//     break;
//     case 3:
//         console.log(post);
//     break;
//     default:
//         alert("Такого варіанта немає")
// }



//Змінна lang може приймати 4 значення: 'ua', 'en', 'ru', 'fr'. За допомогою конструкції switch виведи на екран назву місяця в залежності від обраної мови. Наприклад, якщо lang = 'fr', то в консоль виводимо "Janvier".
// Вибираємо мову
// let lang = "fr"; // Можна змінити на 'ua', 'en', 'ru', 'fr
// let month;
// const ua = "Kviteny"
// const en = "April"
// const ru = "Aprel"
// const de = "April"
// const ch = "Duben"
// const fr = "Avril"
// alert(
//   `Виберіть один з мов: ua, en, ru, de, ch, fr`
// );
// const leng = prompt("Вберіть одну з мов")
// switch (leng) {
//     case "ua":
//         alert(ua)
//         break;
//     case "en":
//         alert(en)
//         break;
//     case "ru":
//         alert(ru)
//         break;
//     case "de":
//         alert(de)
//         break;
//     case "ch":
//         alert(ch)
//         break;
//     case "fr":
//         alert(fr)
//         break;
//     default:
//         alert("Такої мови немає")
// }


// Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).

// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
//  - Загальна сума витрачених коштів зберігається в змінній totalSpent
//  - Сума поточного платежа зберігається в змінній payment
//  - Знижка зберігається в змінній discount

//  - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
//  - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
//  - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
//  - Якщо витрачено менше 100) - не партнер, знижка 0%

//  - В результаті вивести повідомлення
//  «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'const
// const totalSpent = Number(prompt("Скільки ви витратили коштів в нашому магазині"))
// const payment = Number(prompt("сума поточного платежа"))
// let discount = 0;
// let message = ""
// if (totalSpent > 5000) {
//     discount = 10;
//     message = `Золотий партнер, ваша знижка 10%`
// } else if (totalSpent > 1000 && totalSpent <= 5000) {
//     discount = 5;
//     message = `Срібний партнер, ваша знижка 5%`
// } else if (totalSpent > 100 && totalSpent <= 1000) {
//     discount = 2;
//     message = `Бронзовий партнер, вша знижка 2%`
// } else {
//     discount = 0;
//     message = `У вас ще немає партнерської знижки`
// }
// let final = payment - (payment * discount / 100)
// alert(`Оформляемо замовлення на суму ${payment} зі знижкою ${discount}%`);
// alert(`Сумма до сплати після знижки становить ${final}`)
// console.log(message);